wty2019wty/esp32c3-ir-web-ESP32-C3/sdkconfig.defaults
# ESP32-C3 SuperMini: 4MB flash (ESP32C3FN4)
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# 1kHz tick for snappier timing
CONFIG_FREERTOS_HZ=1000

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# NVS encryption: HMAC scheme derives the NVS keys from an eFuse key.
# The eFuse key (KEY4) is generated and burned automatically on first boot
# with this configuration - this is irreversible.
CONFIG_NVS_ENCRYPTION=y
CONFIG_NVS_SEC_KEY_PROTECT_USING_HMAC=y
# ！！！！！！！！！！！！！！！！！！！！
CONFIG_NVS_SEC_HMAC_EFUSE_KEY_ID=4
# ！！！！！！！！！！！！！！！！！！！！

# WebSocket server (status / frame push to replace polling)
CONFIG_HTTPD_WS_SUPPORT=y

# IR capture: up to 1024 alternating segments per frame (RMT RX ping-pong
# accumulates long frames in RAM). History depth scaled down to keep the
# static RAM budget sane (each slot = frame header + 1024 x 4 bytes).
CONFIG_IR_TOOL_MAX_RX_SEGS=1024
CONFIG_IR_TOOL_HISTORY_DEPTH=8

# MQTT: let one full IR frame (raw durations) fit in a single packet.
# Default 1024 bytes would fragment multi-KB frame payloads.
CONFIG_MQTT_BUFFER_SIZE=12288

CONFIG_PM_ENABLE=y
